{"class_name": "Model", "config": {"name": "model_27", "layers": [{"name": "input_27", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 120, 120, 3], "dtype": "float32", "sparse": false, "name": "input_27"}, "inbound_nodes": []}, {"name": "gaussian_noise_27", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_27", "trainable": true, "stddev": 0.1}, "inbound_nodes": [[["input_27", 0, 0, {}]]]}, {"name": "conv2d_118", "class_name": "Conv2D", "config": {"name": "conv2d_118", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gaussian_noise_27", 0, 0, {}]]]}, {"name": "conv2d_119", "class_name": "Conv2D", "config": {"name": "conv2d_119", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_118", 0, 0, {}]]]}, {"name": "batch_normalization_83", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_83", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_119", 0, 0, {}]]]}, {"name": "dropout_83", "class_name": "Dropout", "config": {"name": "dropout_83", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_83", 0, 0, {}]]]}, {"name": "conv2d_transpose_86", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_86", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_83", 0, 0, {}]]]}, {"name": "conv2d_transpose_87", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_87", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_86", 0, 0, {}]]]}, {"name": "batch_normalization_84", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_84", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_87", 0, 0, {}]]]}, {"name": "dropout_84", "class_name": "Dropout", "config": {"name": "dropout_84", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_84", 0, 0, {}]]]}, {"name": "conv2d_120", "class_name": "Conv2D", "config": {"name": "conv2d_120", "trainable": true, "filters": 3, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_84", 0, 0, {}]]]}], "input_layers": [["input_27", 0, 0]], "output_layers": [["conv2d_120", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}